# INTRODUCTION

***Pandas is generally used for Data Analysis.***
***It allows importing data from various file formats ex- Json,csv,Sql,Excel,etc***

***FEATURES:
    Data Manipulation,
    Reading and Writing Data,
    Reshaping of data,
    Data Filteration,
    Data cleaning***

# **Creating Dataframe**

The best way to create a dataframe in python is to use **Dictionary**

In [1]:
import pandas as pd

C:\Users\DELL\AppData\Local\Temp\ipykernel_2272\4080736814.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
dict_1={"car":["city","ignis","800","Verna","Venue","Punto"],"brand":["Honda","maruti","Maruti","Hyundia","Hyundai","Fiat"],
         "cost":[900000,600000,100000,800000,950000,750000],"year":[5,7,10,4,2,6]}

In [3]:
auto=pd.DataFrame(dict_1)

In [4]:
auto

     car    brand    cost  year
0   city    Honda  900000     5
1  ignis   maruti  600000     7
2    800   Maruti  100000    10
3  Verna  Hyundia  800000     4
4  Venue  Hyundai  950000     2
5  Punto     Fiat  750000     6

In [5]:
auto.to_csv('automobile.csv')

# ***Importing Dataframe***

In [6]:

import pandas as pd

In [8]:
data=pd.read_csv("titanic.csv")

In [9]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [11]:
data.shape

(891, 12)

In [12]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [13]:
data['Embarked'].value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [14]:
data["Sex"].unique()

array(['male', 'female'], dtype=object)

# ***Accessing Columns***

In [15]:
data['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [16]:
data[['Name','Sex']]

                                                  Name     Sex
0                              Braund, Mr. Owen Harris    male
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female
2                               Heikkinen, Miss. Laina  female
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
4                             Allen, Mr. William Henry    male
..                                                 ...     ...
886                              Montvila, Rev. Juozas    male
887                       Graham, Miss. Margaret Edith  female
888           Johnston, Miss. Catherine Helen "Carrie"  female
889                              Behr, Mr. Karl Howell    male
890                                Dooley, Mr. Patrick    male

[891 rows x 2 columns]

# Accessing Rows

In [17]:
data.iloc[[0]]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [18]:
data.loc[1:5,['Name',"Sex"]]

                                                Name     Sex
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female
2                             Heikkinen, Miss. Laina  female
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
4                           Allen, Mr. William Henry    male
5                                   Moran, Mr. James    male

# Changing index

In [19]:
data=data.set_index("PassengerId")

In [20]:
data.head(10)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

# ***Filtering of data***

In [21]:
new_data=data["Sex"]=="male"

In [22]:
data.loc[new_data]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [23]:
isin_1 = auto['car'].isin(['800','city'])

In [24]:
auto.loc[isin_1]

    car   brand    cost  year
0  city   Honda  900000     5
2   800  Maruti  100000    10

In [25]:
start=auto['brand'].str.startswith('H')
auto.loc[start]

     car    brand    cost  year
0   city    Honda  900000     5
3  Verna  Hyundia  800000     4
4  Venue  Hyundai  950000     2

In [ ]:
ends = auto['brand'].str.endswith('i')
auto.loc[ends]

In [ ]:
contains = ~auto['brand'].str.contains('o')
auto.loc[contains]

In [ ]:
auto.loc[-contains]

In [ ]:
isna = auto['car'].isna()
auto.loc[isna]

In [ ]:
notna = auto['car'].notna()
auto.loc[notna]

# Sorting of Data

In [ ]:
auto.sort_values("cost")

In [ ]:
data.sort_values(['Age', 'Sex'],
                       ascending=[True, False])

# ***Updating Columns and Rows***

Changing the name of columns

In [ ]:
auto.columns=[x.capitalize() for x in auto.columns]

In [ ]:
auto

In [ ]:
auto.columns=[x.lower() for x in auto.columns]

In [ ]:
auto

In [ ]:
auto.rename(columns={"brand":"company","cost":"price"},inplace=True)

In [ ]:
auto

***Updating Columns***

In [ ]:
auto["price"]=auto["price"].replace({600000:100000})

In [ ]:
auto

In [ ]:
auto["car"].apply(str.upper)

In [ ]:
def price_change(price):
    return price/10

In [ ]:
auto["price"].apply(price_change)

In [ ]:
auto["price"].apply(lambda x:x*10)

In [ ]:
auto["car"].replace({"city":"city zx","ignis":"swift"})

***Updating Rows***

In [ ]:
auto.loc[2,["car","price"]]=["dezire",600000]

In [ ]:
auto

***Adding and removing a column***

In [ ]:
fuel_type=["Diesel","Petrol","Petrol","Diesel","Petrol","Diesel"]

In [ ]:
auto["Fuel Types"]=fuel_type

In [ ]:
auto

In [ ]:
auto.drop("Fuel Types",axis=1,inplace=True)

***Adding and Removing Rows***

In [ ]:
auto=auto.append({"car":"Tiago","company":"TATA"},ignore_index=True)

In [ ]:
auto.drop(index=6)

# Grouping And Aggregation

In [ ]:
groups = data.groupby(['Sex'])

In [ ]:
groups.mean()

In [ ]:
groups.size()

In [ ]:
groups.count()

# Cleaning of Data

In [ ]:
import numpy as np

dict_1={"car":["city","ignis",np.nan,"Verna","Venue","Punto",np.nan],"brand":["Honda","maruti","Maruti","Hyundia",np.nan,"Fiat",np.nan],
         "cost":[900000,600000,np.nan,800000,950000,750000,np.nan,],"year":[5,7,10,np.nan,np.nan,6,np.nan]}        


auto=pd.DataFrame(dict_1)

In [ ]:
auto.isnull().sum()

In [ ]:
auto.dropna(axis="index",how='all',subset=["cost"])

In [ ]:
auto["cost"].fillna(0,inplace=True)

In [ ]:
auto